In [1]:
# Section 9: Set Operators
'''
This section will focus on SET Operators. We have already covered how to join tables together based on relationships between these 
tables and now SET Operators will show you how to combine the result of multiple queries into a single set

After completing this section you will learn about:
- UNION and UNION ALL
- INTERSECT
- MINUS

We will round this section off with a quiz
'''

'\nThis section will focus on SET Operators. We have already covered how to join tables together based on relationships between these \ntables and now SET Operators will show you how to combine the result of multiple queries into a single set\n\nAfter completing this section you will learn about:\n- UNION and UNION ALL\n- INTERSECT\n- MINUS\n\nWe will round this section off with a quiz\n'

In [2]:
# Union - keep unique / Union ALL: keep duplicate 
'''
select * from emp
union
select * from emp; -- 14


select * from emp
union all 
select * from emp; -- 28


select * from emp where deptno=10
union
select * from emp where deptno = 20;


select empno,ename from emp where deptno=10
union
select * from emp where deptno = 20;


'''

'\nselect * from emp\nunion\nselect * from emp; -- 14\n\n\nselect * from emp\nunion all \nselect * from emp; -- 28\n\n\nselect * from emp where deptno=10\nunion\nselect * from emp where deptno = 20;\n\n\nselect empno,ename from emp where deptno=10\nunion\nselect * from emp where deptno = 20;\n\n\n'

In [3]:
# Intersect
'''
The SQL INTERSECT operator is used to combine two SELECT statements, and return rows only from the first SELECT statement that is identical to a row in the second SELECT statement.
-- return common rows 
select * from emp where deptno = 10
intersect
select * from emp where deptno  = 20;

--
select * from dept

-- 
select deptno from dept
intersect 
select deptno from emp;

---
select deptno from emp
intersect
select deptno from dept;
 
-- 
select distinct deptno from emp;

'''

'\n-- return common rows \nselect * from emp where deptno = 10\nintersect\nselect * from emp where deptno  = 20;\n\n--\nselect * from dept\n\n-- \nselect deptno from dept\nintersect \nselect deptno from emp;\n\n---\nselect deptno from emp\nintersect\nselect deptno from dept;\n \n-- \nselect distinct deptno from emp;\n\n'

In [4]:
# Minus: return the result only which is present in A but not in B 
'''
select deptno from dept
minus 
select deptno from emp; -- 40 

select deptno from emp
minus 
select deptno from dept; --no data found 

'''

'\nselect deptno from dept\nminus \nselect deptno from emp; -- 40 \n\nselect deptno from emp\nminus \nselect deptno from dept; --no data found \n\n'